# Add Taps
tap "derailed/k9s"
tap "derailed/popeye"
tap "fluxcd/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "nats-io/nats-tools"
tap "ngrok/ngrok"
tap "shopify/shopify"
tap "tofuutils/tap"
tap "vectordotdev/brew"
tap "weaveworks/tap"
tap "jesseduffield/lazygit"

# Brew install
brew "cryptography"
brew "python@3.12"
brew "awscli"
brew "bash"
brew "bash-completion"
brew "libssh2"
brew "libmagic"
brew "libomp"
brew "utf8proc"
brew "bat"
brew "glib"
brew "cairo"
brew "colima"
brew "conftest"
brew "coreutils"
brew "cosign"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "docker-credential-helper"
brew "fd"
brew "fzf"
brew "gh"
brew "git-lfs"
brew "p11-kit"
brew "gnupg"
brew "grpcurl"
brew "harfbuzz"
brew "helm"
brew "hey"
brew "htop"
brew "ipcalc"
brew "jq"
brew "kind"
brew "kubecolor"
brew "kubeconform"
brew "kubectx"
brew "kustomize"
brew "minikube"
brew "nats-server"
brew "neovim"
brew "nushell"
brew "opa"
brew "openjdk@11"
brew "openapi-generator"
brew "opentofu"
brew "postgresql@14"
brew "postgresql@15"
brew "pre-commit"
brew "pwgen"
brew "pyenv"
brew "pyenv-virtualenv"
brew "redis"
brew "ripgrep"
brew "ast-grep"
brew "rpm"
brew "six"
brew "starship"
brew "stern"
brew "telnet"
brew "terragrunt"
brew "tflint"
brew "terraform"
brew "terraform-ls"
brew "tmux"
brew "toxiproxy"
brew "tree"
brew "upx"
brew "watch"
brew "wget"
brew "yamllint"
brew "yq"
brew "derailed/k9s/k9s"
brew "derailed/popeye/popeye"
brew "fluxcd/tap/flux"
brew "nats-io/nats-tools/nats"
brew "vectordotdev/brew/vector"
brew "weaveworks/tap/eksctl"
brew "upbound/tap/up"
brew "terragrunt-atlantis-config"
brew "jesseduffield/lazygit/lazygit"
brew "gcc"

# Brew install --cask
cask "ghostty"
cask "ngrok"
cask "wireshark"

# Work related
instance_eval(File.read("/Users/pauvilella/.work/Brewfile"))
